In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data.csv')

In [3]:
df

    name  number  money
0  Kevin      52  10000
1   Mary      38   8000
2  Peter      22  80000

In [4]:
df['number']

0    52
1    38
2    22
Name: number, dtype: int64

In [5]:
df['number']>30

0     True
1     True
2    False
Name: number, dtype: bool

In [6]:
df.loc[df['number']>30]

    name  number  money
0  Kevin      52  10000
1   Mary      38   8000

In [7]:
df.iloc[0]

name      Kevin
number       52
money     10000
Name: 0, dtype: object

In [8]:
df2 = pd.DataFrame({
    'name':['kev','mar','Xx'],
    'number':['52','38','22'],
    'money':[1000,800,8000]
})

In [9]:
df2

  name number  money
0  kev     52   1000
1  mar     38    800
2   Xx     22   8000